Revit 2027 API
BuiltInFailures.DimensionFailures.EqualityConstraintsUnsatisfied Property
 Equality constraints are not satisfied. The action either violates a locked constraint or tries to modify a sketch based object outside of the sketch mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EqualityConstraintsUnsatisfied { get; }
Public Shared ReadOnly Property EqualityConstraintsUnsatisfied As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EqualityConstraintsUnsatisfied {
	FailureDefinitionId^ get ();
}
static member EqualityConstraintsUnsatisfied : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace